from grimm.токенизер import ТокенСпејс

КРАЈ = ''


class Линајзер():
    def __init__(бре, токени):
        бре.токени = токени
        бре.линије = []

    def __call__(бре):
        бре.и = iter(бре.токени)
        т = next(бре.и, КРАЈ)
        while т != КРАЈ:
            т = бре.линија(т)
        return бре.линије

    def линија(бре, т):
        if т == КРАЈ:
            return
        л = ""
        if type(т) == ТокенСпејс:
            т = next(бре.и, КРАЈ)
        while True:
            if т.текст == '"':
                л += т.текст
                т = next(бре.и, КРАЈ)
                т, нл = бре.директан_говор(т)
                л += нл
            elif т.текст in ['\n', '.', '!', '?', КРАЈ]:
                if т.текст not in ['\n', КРАЈ]:
                    л += т.текст
                бре.линије.append(л)
                т = next(бре.и, КРАЈ)
                return т
            else:
                л += т.текст
                т = next(бре.и, КРАЈ)

    def директан_говор(бре, т):
        л = ""
        while True:
            if т.текст == '"':
                л += т.текст
                т = next(бре.и, КРАЈ)
                return т, л
            elif т.текст in [КРАЈ]:
                return т, л
            else:
                л += т.текст
                т = next(бре.и, КРАЈ)

