КРАЈ = '<<крај>>'


class Линајзер():
    def __init__(бре, токени):
        бре.токени = токени
        бре.линије = []

    def __call__(бре):
        бре.и = iter(бре.токени)
        т = next(бре.и, КРАЈ)
        while т != КРАЈ:
            бре.линија(т)
            т = next(бре.и, КРАЈ)
        return бре.линије

    def линија(бре, т):
        if т == КРАЈ:
            return
        л = ""
        while True:
            if т.текст == '\n' or т.текст == '':  # празан стринг је КРАЈ токен
                бре.линије.append(л)
                return
            else:
                л += т.текст
                т = next(бре.и, КРАЈ)

