from grimm.токенизер import ТокенСпејс, ТокенЗаКрај, ТокенСам, ТокенРеч
КРАЈ = ТокенЗаКрај('')


def крај(т):
    return type(т) == ТокенЗаКрај


def спејс(т):
    return type(т) == ТокенСпејс


def реч(т):
    return type(т) == ТокенРеч


def крај_реченице(т):
    return т.текст in ['.', '!', '?']


def крај_дела_реченице(т):
    return т.текст in [',', ';', ':']


def нова_линија(т):
    return т.текст == '\n'


def тачка(т):
    return т.текст == '.'


class Линајзер():

    def јел_наводник(бре, т):
        return т.текст == бре.наводник

    def __init__(бре, токени):
        def џемирај(т):
            if реч(т):
                return ТокенРеч('џемо') if len(т.текст) > 3 else т
            else:
                return т
        бре.линије = []
        бре.токени = токени
        # бре.токени = [џемирај(т) for т in токени]
        број_дуплих = len([т for т in токени if т.текст == '"'])
        број_обичних = len([т for т in токени if т.текст == "'"])
        бре.наводник = "'" if број_обичних > број_дуплих else '"'
        бре.директан_говор = False

    def __call__(бре):
        бре.и = iter(бре.токени)
        т = next(бре.и, КРАЈ)
        while not крај(т):
            т = бре.линија(т)
        return [л.strip() for л in бре.линије]

    def додај(бре, линија):
        if линија == '' and (бре.линије and бре.линије[-1] == ''):
            return
        if линија == '' and бре.директан_говор:
            return
        if бре.директан_говор:
            бре.линије.append(бре.наводник + линија + бре.наводник)
        else:
            бре.линије.append(линија)

    def линија(бре, т):
        if крај(т):
            return т
        л = ""
        if спејс(т):
            т = next(бре.и, КРАЈ)
            if крај(т):
                бре.додај(л)
                return т
        while True:
            if бре.јел_наводник(т) and not бре.директан_говор:
                if л != "":
                    бре.додај(л)
                т = next(бре.и, КРАЈ)
                бре.директан_говор = True
                return т
            elif бре.јел_наводник(т) and бре.директан_говор:
                бре.додај(л)
                т = next(бре.и, КРАЈ)
                бре.директан_говор = False
                return т
            elif нова_линија(т):
                бре.додај(л)
                бре.додај('')
                т = next(бре.и, КРАЈ)
                return т
            elif крај_реченице(т):
                л += т.текст
                бре.додај(л)
                п = т
                т = next(бре.и, КРАЈ)
                if бре.директан_говор and тачка(п) and бре.јел_наводник(т):
                    бре.линије.append('')
                else:
                    бре.додај('')
                return т
            elif крај_дела_реченице(т):
                л += т.текст
                бре.додај(л)
                т = next(бре.и, КРАЈ)
                return т
            elif крај(т):
                бре.додај(л)
                return т
            else:
                л += т.текст
                т = next(бре.и, КРАЈ)

