class Словизер():
    def __init__(бре, текст):
        бре._и = iter(текст)
        бре._индекс = -1
        бре._претходно = -1
        бре._тренутно = -1
        бре._следеће = -1
        бре._нема_више = False
        try:
            бре._тренутно = next(бре._и)
            бре._индекс = 0
            try:
                бре._следеће = next(бре._и)
            except StopIteration:
                pass
        except StopIteration:
            бре._нема_више = True

    @property
    def претходно(бре):
        return бре._претходно

    @property
    def тренутно(бре):
        return бре._тренутно

    @property
    def следеће(бре):
        return бре._следеће

    @property
    def индекс(бре):
        return бре._индекс

    def напред(бре):
        бре._индекс += 1
        бре._претходно = бре._тренутно
        бре._тренутно = бре._следеће
        try:
            бре._следеће = next(бре._и)
        except StopIteration as е:
            if бре._нема_више:
                raise е
            бре._нема_више = True
            бре._следеће = -1

