import re
from collections import namedtuple
from grimm.словизер import Словизер

_ТокенФиксни = namedtuple('_ТокенФиксни', ['текст'])
_ТокенРеч = namedtuple('_ТокенРеч', ['текст'])
_ТокенСпејс = namedtuple('_ТокенСпејс', ['текст'])
_ТокенСам = namedtuple('_ТокенСам', ['текст'])
_ТокенНеодређениНаводник = namedtuple('_ТокенНеодређениНаводник', ['текст'])
_ТокенСамНеаски = namedtuple('_ТокенСамНеаски', ['текст'])
_ТокенБрој = namedtuple('_ТокенБрој', ['текст'])
_ТокенСумњив = namedtuple('_ТокенСумњив', ['текст'])


ТОКЕН_ЗА_ПОЧЕТАК = _ТокенФиксни('')
ТОКЕН_ЗА_КРАЈ = _ТокенФиксни('')
ТОКЕН_НОВА_ЛИНИЈА = _ТокенФиксни('\n')
ТОКЕН_ОТВОРЕНИ_НАВОДНИК = _ТокенФиксни('„')
ТОКЕН_ЗАТВОРЕНИ_НАВОДНИК = _ТокенФиксни('“')

ФИКСНИ_ТОКЕНИ = [ТОКЕН_ЗА_ПОЧЕТАК, ТОКЕН_ЗА_КРАЈ, ТОКЕН_НОВА_ЛИНИЈА, ТОКЕН_ОТВОРЕНИ_НАВОДНИК, ТОКЕН_ЗАТВОРЕНИ_НАВОДНИК]


def је_токен_за_крај(т):
    return т == ТОКЕН_ЗА_КРАЈ


def је_спејс(т):
    return type(т) == _ТокенСпејс


def је_реч(т):
    return type(т) == _ТокенРеч


def је_неодређени_наводник(т):
    return type(т) == _ТокенНеодређениНаводник


def је_отворени_наводник(т):
    return type(т) == ТОКЕН_ОТВОРЕНИ_НАВОДНИК


def је_затворени_наводник(т):
    return type(т) == ТОКЕН_ЗАТВОРЕНИ_НАВОДНИК


def је_број(т):
    return type(т) == _ТокенБрој


def је_нова_линија(т):
    return type(т) == ТОКЕН_НОВА_ЛИНИЈА


def токен_сам(к):
    for ф in ФИКСНИ_ТОКЕНИ:
        if к == ф.текст:
            return ф
    return _ТокенСам(к)


КРАЈ_ТЕКСТ = '<<крај>>'
СЛОВА = re.compile('[a-zA-ZßäöüÄÖÜ]')
СЕПАРАТОРИ = re.compile(r'[=.,:;"\'\(\)\[\]!?\-]')
НЕАСКИ_СЕПАРАТОРИ = re.compile(r'[–‹›]')
ЦИФРЕ = re.compile(r'[0-9]')
СУМЊИВИ = re.compile(r'[\^\/`]')  # највероватније за игнорисати


class Токенизер():
    def __init__(бре, текст):
        бре.текст = текст
        бре.токени = []
        број_дуплих = len([ц for ц in текст if ц == '"'])
        број_обичних = len([ц for ц in текст if ц == "'"])
        бре._наводник = "'" if број_обичних > број_дуплих else '"'

    def __call__(бре):
        бре.и = Словизер(бре.текст, -1, -1)
        бре.израз(next(бре.и, КРАЈ_ТЕКСТ))
        return бре.токени

    def израз(бре, к):
        while к != КРАЈ_ТЕКСТ:
            if к == КРАЈ_ТЕКСТ:
                бре.токени.append(ТОКЕН_ЗА_КРАЈ)
                return
            elif СЛОВА.fullmatch(к):
                к = бре.реч(к)
            elif к == ' ':
                к = бре.спејс(к)
            elif к == '\n' or СЕПАРАТОРИ.fullmatch(к):
                к = бре.сам(к)
            elif НЕАСКИ_СЕПАРАТОРИ.fullmatch(к):
                к = бре.сам_неаски(к)
            elif СУМЊИВИ.fullmatch(к):
                к = бре.сумњив(к)
            elif ЦИФРЕ.fullmatch(к):
                к = бре.број(к)
            else:
                raise Exception(f'Непознато слово: "{к}"')
        бре.токени.append(ТОКЕН_ЗА_КРАЈ)

    def реч(бре, к):
        текст = к
        к = next(бре.и, КРАЈ_ТЕКСТ)
        while СЛОВА.fullmatch(к):
            текст += к
            к = next(бре.и, КРАЈ_ТЕКСТ)
        бре.токени.append(_ТокенРеч(текст))
        return к

    def спејс(бре, к):
        текст = к
        к = next(бре.и, КРАЈ_ТЕКСТ)
        while к == ' ':
            текст += к
            к = next(бре.и, КРАЈ_ТЕКСТ)
        бре.токени.append(_ТокенСпејс(текст))
        return к

    def сам(бре, к):
        if к == бре._наводник:
            бре.токени.append(_ТокенНеодређениНаводник(к))
        else:
            бре.токени.append(токен_сам(к))
        return next(бре.и, КРАЈ_ТЕКСТ)

    def сам_неаски(бре, к):
        бре.токени.append(_ТокенСамНеаски(к))
        return next(бре.и, КРАЈ_ТЕКСТ)

    def сумњив(бре, к):
        бре.токени.append(_ТокенСумњив(к))
        return next(бре.и, КРАЈ_ТЕКСТ)

    def број(бре, к):
        текст = к
        к = next(бре.и, КРАЈ_ТЕКСТ)
        while ЦИФРЕ.fullmatch(к):
            текст += к
            к = next(бре.и, КРАЈ_ТЕКСТ)
        бре.токени.append(_ТокенБрој(текст))
        return к

