import re
import sys
from collections import namedtuple
from grimm.словизер import Словизер

ТокенЗаКрај = namedtuple('ТокенЗаКрај', ['текст', 'линија'])
ТокенРеч = namedtuple('ТокенРеч', ['текст', 'линија'])
ТокенСпејс = namedtuple('ТокенСпејс', ['текст', 'линија'])
ТокенСам = namedtuple('ТокенСам', ['текст', 'линија'])
ТокенОтворениНаводник = namedtuple('ТокенОтворениНаводник', ['текст', 'линија'])
ТокенЗатворениНаводник = namedtuple('ТокенЗатворениНаводник', ['текст', 'линија'])
ТокенСамНеаски = namedtuple('ТокенСамНеаски', ['текст', 'линија'])
ТокенБрој = namedtuple('ТокенБрој', ['текст', 'линија'])
ТокенСумњив = namedtuple('ТокенСумњив', ['текст', 'линија'])

КРАЈ = '<<крај>>'
СЛОВА = re.compile('[a-zA-ZßäöüÄÖÜ]')
СЕПАРАТОРИ = re.compile(r'[=.,:;"\'\(\)\[\]!?\-]')
НЕАСКИ_СЕПАРАТОРИ = re.compile(r'[–‹›]')
ЦИФРЕ = re.compile(r'[0-9]')
СУМЊИВИ = re.compile(r'[\^\/`]')  # највероватније за игнорисати


class Токенизер():
    def __init__(бре, текст):
        бре.текст = текст
        бре.токени = []
        број_дуплих = len([ц for ц in текст if ц == '"'])
        број_обичних = len([ц for ц in текст if ц == "'"])
        бре._наводник = "'" if број_обичних > број_дуплих else '"'

    def __call__(бре):
        бре.и = Словизер(бре.текст)
        бре.израз(next(бре.и, КРАЈ))
        return бре.токени

    def израз(бре, к):
        while к != КРАЈ:
            if к == КРАЈ:
                бре.токени.append(ТокенЗаКрај('', бре.и.линија))
                return
            elif СЛОВА.fullmatch(к):
                к = бре.реч(к)
            elif к == ' ':
                к = бре.спејс(к)
            elif к == '\n' or СЕПАРАТОРИ.fullmatch(к):
                к = бре.сам(к)
            elif НЕАСКИ_СЕПАРАТОРИ.fullmatch(к):
                к = бре.сам_неаски(к)
            elif СУМЊИВИ.fullmatch(к):
                к = бре.сумњив(к)
            elif ЦИФРЕ.fullmatch(к):
                к = бре.број(к)
            else:
                raise Exception(f'Непознато слово: "{к}"')
        бре.токени.append(ТокенЗаКрај('', бре.и.линија))

    def реч(бре, к):
        текст = к
        к = next(бре.и, КРАЈ)
        while СЛОВА.fullmatch(к):
            текст += к
            к = next(бре.и, КРАЈ)
        бре.токени.append(ТокенРеч(текст, бре.и.линија))
        return к

    def спејс(бре, к):
        текст = к
        к = next(бре.и, КРАЈ)
        while к == ' ':
            текст += к
            к = next(бре.и, КРАЈ)
        бре.токени.append(ТокенСпејс(текст, бре.и.линија))
        return к

    def сам(бре, к):
        if к == бре._наводник:
            return бре.наводник(к)
        бре.токени.append(ТокенСам(к, бре.и.линија))
        return next(бре.и, КРАЈ)

    def наводник(бре, к):
        if бре.и.претходно in [',', '.', '!']:
            бре.токени.append(ТокенОтворениНаводник(к, бре.и.линија))
        elif бре.и.претходно in [' ', '\n']:
            бре.токени.append(ТокенЗатворениНаводник(к, бре.и.линија))
        else:
            бре.токени.append(ТокенСам(к, бре.и.линија))
        return next(бре.и, КРАЈ)

    def сам_неаски(бре, к):
        бре.токени.append(ТокенСамНеаски(к, бре.и.линија))
        return next(бре.и, КРАЈ)

    def сумњив(бре, к):
        бре.токени.append(ТокенСумњив(к, бре.и.линија))
        return next(бре.и, КРАЈ)

    def број(бре, к):
        текст = к
        к = next(бре.и, КРАЈ)
        while ЦИФРЕ.fullmatch(к):
            текст += к
            к = next(бре.и, КРАЈ)
        бре.токени.append(ТокенБрој(текст, бре.и.линија))
        return к


def главна():
    with open('/tmp/www.grimmstories.com/1/ff4eb3599fcbe363a89a9553dfef5385840ec239afbd4d9c604db23c5b3b837c', 'r') as ф:
        ток = Токенизер(ф.read())
        ток()


if __name__ == '__main__':
    sys.setrecursionlimit(10000)
    главна()

