import re
import sys
from collections import namedtuple

ТокенЗаКрај = namedtuple('ТокенЗаКрај', ['текст'])
ТокенРеч = namedtuple('ТокенРеч', ['текст'])
ТокенСпејс = namedtuple('ТокенСпејс', ['текст'])
ТокенСам = namedtuple('ТокенСам', ['текст'])
ТокенСамНеаски = namedtuple('ТокенСамНеаски', ['текст'])
ТокенБрој = namedtuple('ТокенБрој', ['текст'])
ТокенСумњив = namedtuple('ТокенСумњив', ['текст'])

КРАЈ = '<<крај>>'
СЛОВА = re.compile('[a-zA-ZßäöüÄÖÜ]')
СЕПАРАТОРИ = re.compile(r'[=.,:;"\'\(\)\[\]!?\-]')
НЕАСКИ_СЕПАРАТОРИ = re.compile(r'[–‹›]')
ЦИФРЕ = re.compile(r'[0-9]')
СУМЊИВИ = re.compile(r'[\^\/`]')  # највероватније за игнорисати


class Токенизер():
    def __init__(бре, текст):
        бре.текст = текст
        бре.токени = []

    def __call__(бре):
        бре.и = iter(бре.текст)
        бре.израз(next(бре.и, КРАЈ))
        return бре.токени

    def израз(бре, к):
        if к == КРАЈ:
            бре.токени.append(ТокенЗаКрај(''))
        elif СЛОВА.fullmatch(к):
            бре.реч(к)
        elif к == ' ':
            бре.спејс(к)
        elif к == '\n' or СЕПАРАТОРИ.fullmatch(к):
            бре.сам(к)
        elif НЕАСКИ_СЕПАРАТОРИ.fullmatch(к):
            бре.сам_неаски(к)
        elif СУМЊИВИ.fullmatch(к):
            бре.сумњив(к)
        elif ЦИФРЕ.fullmatch(к):
            бре.број(к)
        else:
            raise Exception(f'Непознато слово: "{к}"')

    def реч(бре, к):
        текст = к
        к = next(бре.и, КРАЈ)
        while СЛОВА.fullmatch(к):
            текст += к
            к = next(бре.и, КРАЈ)
        бре.токени.append(ТокенРеч(текст))
        бре.израз(к)

    def спејс(бре, к):
        текст = к
        к = next(бре.и, КРАЈ)
        while к == ' ':
            текст += к
            к = next(бре.и, КРАЈ)
        бре.токени.append(ТокенСпејс(текст))
        бре.израз(к)

    def сам(бре, к):
        бре.токени.append(ТокенСам(к))
        бре.израз(next(бре.и, КРАЈ))

    def сам_неаски(бре, к):
        бре.токени.append(ТокенСамНеаски(к))
        бре.израз(next(бре.и, КРАЈ))

    def сумњив(бре, к):
        бре.токени.append(ТокенСумњив(к))
        бре.израз(next(бре.и, КРАЈ))

    def број(бре, к):
        текст = к
        к = next(бре.и, КРАЈ)
        while ЦИФРЕ.fullmatch(к):
            текст += к
            к = next(бре.и, КРАЈ)
        бре.токени.append(ТокенБрој(текст))
        бре.израз(к)


def главна():
    with open('/tmp/www.grimmstories.com/1/ff4eb3599fcbe363a89a9553dfef5385840ec239afbd4d9c604db23c5b3b837c', 'r') as ф:
        ток = Токенизер(ф.read())
        ток()


if __name__ == '__main__':
    sys.setrecursionlimit(10000)
    главна()

