from grimm.токенизер import ТокенСпејс, ТокенЗаКрај, ТокенСам, ТокенРеч
from grimm.токенизер import ТокенНаводник, ТокенЗатворениНаводник, ТокенОтворениНаводник
from grimm.токенизер import токен_за_почетак, токен_за_крај
from grimm.словизер import Словизер
КРАЈ = ТокенЗаКрај('')


def крај(т):
    return type(т) == ТокенЗаКрај


def неодређен_наводник(т):
    return type(т) == ТокенНаводник


def реч(т):
    return type(т) == ТокенРеч


def спејс(т):
    return type(т) == ТокенСпејс


class Цитатор:
    def __init__(бре, улаз):
        бре.улаз = улаз
        бре.излаз = []

    def __call__(бре):
        бре.и = Словизер(бре.улаз, почетак=токен_за_почетак, крај=токен_за_крај)
        next(бре.и, КРАЈ)
        while not крај(бре.и.тренутно):
            бре.цитирај()
        return бре.излаз

    def цитирај(бре):
        т = бре.и.тренутно
        if неодређен_наводник(т):
            бре.излаз.append(бре.наводник())
        else:
            бре.излаз.append(т)
        next(бре.и, КРАЈ)

    def __str__(бре):
        return ''.join((т.текст for т in бре.излаз))

    def одреди_наводник(бре, прет, след):
        if прет.текст in [' ', '\n', '', ':'] and реч(след):
            return ТокенОтворениНаводник('„')
        elif прет.текст in [',', ';', '.', '!', '?'] and след.текст in [' ', '\n', '']:
            return ТокенЗатворениНаводник('“')
        elif реч(прет) and след.текст in [' ', '\n', '', ';']:
            return ТокенЗатворениНаводник('“')
        return None

    def наводник(бре):
        н = бре.одреди_наводник(бре.и.претходно, бре.и.следеће)
        if н:
            бре.излаз.append(н)
        elif спејс(бре.и.претходно) and спејс(бре.и.следеће):
            бре.излаз.append(ТокенОтворениНаводник('“'))
        else:
            if бре.и.тренутно.текст == "'":
                бре.излаз.append(бре.и.тренутно)
            else:
                досад = ''.join([т.текст for т in бре.излаз])
                raise Exception(f'Лош цитат: ({бре.и.тренутно}), линија={бре.и.линија}, текст={досад[-100:]}')
        return next(бре.и, КРАЈ)

