from grimm.токенизер import ТокенСпејс, ТокенЗаКрај, ТокенСам, ТокенРеч
from grimm.токенизер import ТокенНаводник, ТокенЗатворениНаводник, ТокенОтворениНаводник
КРАЈ = ТокенЗаКрај('', -1)


def крај(т):
    return type(т) == ТокенЗаКрај


class Цитатор:
    def __init__(бре, улаз):
        бре.улаз = улаз
        бре.излаз = []

    def __call__(бре):
        бре.и = iter(бре.улаз)
        т = next(бре.и, КРАЈ)
        while not крај(т):
            т = бре.цитирај(т)
        return бре.излаз

    def цитирај(бре, т):
        бре.излаз.append(т)
        return next(бре.и, КРАЈ)

