from grimm.токенизер import Токенизер


def test_просте_речи():
    текст = 'trläÄ böÖba lanßüÜ'
    ток = Токенизер(текст)
    токени = ток()
    assert len(токени) == 6
    assert текст == ''.join([т.текст for т in токени])


def test_сепаратори():
    текст = 'trlä: böba, lanß.'
    ток = Токенизер(текст)
    токени = ток()
    assert len(токени) == 9
    assert текст == ''.join([т.текст for т in токени])
    assert токени[1].текст == ':'
    assert токени[4].текст == ','
    assert токени[-2].текст == '.'


def test_сепаратори_још():
    текст = 'tr-lä; ba=ba!'
    ток = Токенизер(текст)
    токени = ток()
    assert len(токени) == 10
    assert текст == ''.join([т.текст for т in токени])
    assert токени[1].текст == '-'
    assert токени[3].текст == ';'
    assert токени[6].текст == '='
    assert токени[-2].текст == '!'


def test_сепаратори_још2():
    текст = 'trlä\n[baba](lan)?'
    ток = Токенизер(текст)
    токени = ток()
    assert len(токени) == 10
    assert текст == ''.join([т.текст for т in токени])
    assert токени[1].текст == '\n'
    assert токени[2].текст == '['
    assert токени[4].текст == ']'
    assert токени[5].текст == '('
    assert токени[7].текст == ')'
    assert токени[-2].текст == '?'


def test_сепаратори_неаски():
    текст = 'trläba–ba ›lan‹'
    ток = Токенизер(текст)
    токени = ток()
    assert len(токени) == 8
    assert текст == ''.join([т.текст for т in токени])
    assert токени[1].текст == '–'
    assert токени[4].текст == '›'
    assert токени[6].текст == '‹'


def test_сепаратори_сумњиви():
    текст = 'trläba^ba/ba'
    ток = Токенизер(текст)
    токени = ток()
    assert len(токени) == 6
    assert текст == ''.join([т.текст for т in токени])
    assert токени[1].текст == '^'
    assert токени[3].текст == '/'


def test_број():
    текст = 'trläba123 baba'
    ток = Токенизер(текст)
    токени = ток()
    assert len(токени) == 5
    assert текст == ''.join([т.текст for т in токени])
    assert токени[1].текст == '123'


